

'''
- Создаёт список из 6 строк (*строки определяются в коде, на ваш вкус*).
- Подсчитывает количество строк, содержащих букву `д`.
- Использует циклы для подсчета.
'''


list = ["Жоол", "Дардасв", "ЩАЛмлв", "Длавьмь", "Ддбдмлвда", "Вотвмоа"] # Создаем список строк
count = 0 # создаем переменную count, для подсчета содержащейся буквы д в строках


for i in list: # Перебираем значение списка
	
	letter = 'д' # Инициализируем переменную letter

	if letter in i: # Проверка на содержание в строке буквы 

		count+=1 # Если есть буква д, тогда увеличиваем счетчик на 1.


print(f"количество строк в которых содержится буква д: {count}") # Выводим на экран
